pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_vendor.h
    struct {
      __IOM uint32_t rxi_300_en : 1;            /*!< [0..0] Each bit enable corresponding interrupt. 1: Enable 0:
                                                     Disable                                                                   */
      __IOM uint32_t spic_int_en : 1;           /*!< [1..1] Each bit enable corresponding interrupt. 1: Enable 0:
                                                     Disable                                                                   */
      __IOM uint32_t psrm_cal_fail_int_en : 1;  /*!< [2..2] Each bit enable corresponding interrupt. 1: Enable 0:
                                                     Disable                                                                   */
      __IOM uint32_t psrm_time_out_int_en : 1;  /*!< [3..3] Each bit enable corresponding interrupt. 1: Enable 0:
                                                     Disable                                                                   */
      __IOM uint32_t scorebord_int_en : 1;      /*!< [4..4] Each bit enable corresponding interrupt. 1: Enable 0:
                                                     Disable                                                                   */
    } low_pri_int_imr_b;
  } ;
  
  union {
    __IOM uint32_t low_pri_int_isr;             /*!< (@ 0x0000000C) Low Priority Interrupt Pending Status Register             */
    
    struct {
      __IOM uint32_t rxi_300_int : 1;           /*!< [0..0] RXI300 bus interrupt status. Write 1 clear.                        */
      __IOM uint32_t spic_int   : 1;            /*!< [1..1] SPIC interrupt status, Write 1 clear.                              */
      __IOM uint32_t psrm_cal_fail_int : 1;     /*!< [2..2] PSRAM calibration fail interrupt status. Write 1 clear.            */
      __IOM uint32_t psrm_time_out_int : 1;     /*!< [3..3] PSRAM calibration timeout interrupt status. Write 1 clear.         */
      __IM  uint32_t scoreboard_int : 1;        /*!< [4..4] Scoreboard interrupt status                                        */
    } low_pri_int_isr_b;
  } ;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t anack_ctrl;                  /*!< (@ 0x0000001C) ANA Clock Control Register                                 */
    
    struct {
      __IOM uint32_t anack_rpt  : 16;           /*!< [15..0] The calculation value of ANA clock where the reference
                                                     clock is 40MHz.                                                           */
      __IM  uint32_t            : 8;
      __IOM uint32_t anack_sel  : 2;            /*!< [25..24] 00: Calculation of 4M for 32 cycles (for debug use)
                                                     01: Calculation of 128K for 8 cycles 10: Rsvd 11: Rsvd                    */
      __IM  uint32_t            : 5;
      __IOM uint32_t anack_cmd  : 1;            /*!< [31..31] 1: Enable ANACK calculation and indicate busy when
                                                     the calculation process is on-going. 0: Calculation is
                                                     done. Set as 0 by HW when calibration is done.                            */
    } anack_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t data_fifo_swap_ctrl;         /*!< (@ 0x00000020) FIFO Data Swap Control Register                            */
    
    struct {
      __IOM uint32_t i2c0_tx_bit_swap_en : 1;   /*!< [0..0] I2C TX bits swap enable                                            */
      __IOM uint32_t i2c0_rx_bit_swap_en : 1;   /*!< [1..1] I2C RX bits swap enable                                            */
    } data_fifo_swap_ctrl_b;
  } ;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IM  uint32_t gdma0_isr;                   /*!< (@ 0x00000030) GDMA Interrupt Status Register                             */
    
    struct {
      __IM  uint32_t gdma0_ch0_isr : 1;         /*!< [0..0] GDMA0 Channel 0 interrupt pending status.                          */
      __IM  uint32_t gdma0_ch1_isr : 1;         /*!< [1..1] GDMA0 Channel 1 interrupt pending status.                          */
    } gdma0_isr_b;
  } ;
  
  union {
    __IM  uint32_t uart_isr;                    /*!< (@ 0x00000034) UART Interrupt Pending Status Register                     */
    
    struct {
      __IM  uint32_t uart2_isr  : 1;            /*!< [0..0] UART2 interrupt pending status                                     */
      __IM  uint32_t uart1_isr  : 1;            /*!< [1..1] UART1 interrupt pending status                                     */
      __IM  uint32_t uart0_isr  : 1;            /*!< [2..2] UART0 interrupt pending status                                     */
      __IM  uint32_t uart3_isr  : 1;            /*!< [3..3] UART3 interrupt pending status                                     */
    } uart_isr_b;
  } ;
  
  union {
    __IM  uint32_t wl_isr;                      /*!< (@ 0x00000038) WLAN Interrupt Pending Status Register                     */
    
    struct {
      __IM  uint32_t wlan_page0_int : 1;        /*!< [0..0] Wlan Page0 Interrupt pending status.                               */
      __IM  uint32_t ahb_local_int : 1;         /*!< [1..1] WL page3 interrupt pending status                                  */
    } wl_isr_b;
  } ;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t mbist_ctrl;                  /*!< (@ 0x00000040) MBIST Control Register                                     */
    
    struct {
      __IOM uint32_t mbist_clk_en : 1;          /*!< [0..0] bit mbist clock enable.                                            */
      __IOM uint32_t mbist_rstn : 1;            /*!< [1..1] mbist enable for each mbist group                                  */
      __IOM uint32_t mbist_msel : 2;            /*!< [3..2] mbist mode select, 2'b01, 2'b11---> nrml mode enalbe,
                                                     2'b10, 2'b11 -->drf mode enable                                           */
      __IOM uint32_t mbist_resume : 1;          /*!< [4..4] resume mbist drf test                                              */
      __IOM uint32_t mbist_dyn_rden : 1;        /*!< [5..5] dynamic vdd enable                                                 */
      __IOM uint32_t mbist_resume_ps : 1;       /*!< [6..6] resume mbist ps test                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t mbist_rom_rpt_sel0 : 3;    /*!< [10..8] select mbist rom report result                                    */
    } mbist_ctrl_b;
  } ;
  
  union {
    __IOM uint32_t mbist_func_en_ctrl;          /*!< (@ 0x00000044) MBIST Function Enable Control Register                     */
    
