pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_vendor.h
    struct {
      __IOM uint32_t mbist_fen_cpu_bt : 1;      /*!< [0..0] enable mbist for BT CPU                                            */
      __IOM uint32_t mbist_fen_128x12x4 : 1;    /*!< [1..1] enable mbist for 128x12x4                                          */
      __IOM uint32_t mbist_fen_512x16_bt : 1;   /*!< [2..2] enable mbist for 512x16 BT                                         */
      __IOM uint32_t mbist_fen_128x16_bt : 1;   /*!< [3..3] enable mbist for 128x16 BT                                         */
      __IOM uint32_t mbist_fen_288x32_bt : 1;   /*!< [4..4] enable mbist for 288x32 BT                                         */
      __IOM uint32_t mbist_fen_03 : 1;          /*!< [5..5] enable mbist 3                                                     */
      __IOM uint32_t mbist_fen_06 : 1;          /*!< [6..6] enable mbist 6                                                     */
      __IOM uint32_t mbist_fen_07 : 1;          /*!< [7..7] enable mbist for mbist_07, mbist_09                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t mbist_fen_11 : 1;          /*!< [9..9] enable mbist for mbist_11, mbist_12                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t mbist_fen_13 : 1;          /*!< [11..11] enable mbist for mbist_13, mbist_18, mbist_19                    */
      __IOM uint32_t mbist_fen_17 : 1;          /*!< [12..12] enable mbist 17                                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t mbist_fen_rx2_icache : 1;  /*!< [15..15] enable mbist for RX to I-Cache                                   */
      __IOM uint32_t mbist_fen_rx2_dcache : 1;  /*!< [16..16] enable mbist for RX to D-cache                                   */
      __IOM uint32_t mbist_fen_rx2_dtcm : 1;    /*!< [17..17] enable mbist for RX to DTCM                                      */
      __IOM uint32_t mbist_fen_wmac_e0_dc : 1;  /*!< [18..18] enable mbist for wmac_e0 DC                                      */
      __IOM uint32_t mbist_fen_wmac_e1_dc : 1;  /*!< [19..19] enable mbist for wmac_e1 DC                                      */
      __IOM uint32_t mbist_fen_wpon_e0_dc : 1;  /*!< [20..20] enable mbist for wpon_e0_dc                                      */
      __IOM uint32_t mbist_fen_wpon_e1_dc : 1;  /*!< [21..21] enable mbist for wpon_e1_dc                                      */
      __IOM uint32_t mbist_fen_sdio : 1;        /*!< [22..22] enable mbist for SDIO                                            */
      __IOM uint32_t mbiist_fen_share : 1;      /*!< [23..23] enable mbist for share                                           */
      __IOM uint32_t mbist_fen_rom32kx32 : 1;   /*!< [24..24] enable mbist for 32K x 32                                        */
      __IOM uint32_t mbist_fen_rx2_itcm : 1;    /*!< [25..25] enable mbist for rx to ITCM                                      */
      __IOM uint32_t mbist_fen_wmac_e2_dc : 1;  /*!< [26..26] enable mbist for wmac_e2_dc                                      */
    } mbist_func_en_ctrl_b;
  } ;
  
  union {
    __IM  uint32_t mbist_sta;                   /*!< (@ 0x00000048) MBIST Status Register                                      */
    
    struct {
      __IM  uint32_t mbist_drf_fail : 1;        /*!< [0..0] mbist test status :drf_fail                                        */
      __IM  uint32_t mbist_drf_done : 1;        /*!< [1..1] mbist test status: drf_done                                        */
      __IM  uint32_t mbist_nrml_fail : 1;       /*!< [2..2] mbist test status : normal failed                                  */
      __IM  uint32_t mbist_nrml_done : 1;       /*!< [3..3] mbist test status: normal done                                     */
      __IM  uint32_t mbist_start_pause : 1;     /*!< [4..4] mbist test status :start/pause                                     */
    } mbist_sta_b;
  } ;
  
  union {
    __IM  uint32_t mbist_done;                  /*!< (@ 0x0000004C) MBIST Done Output Register                                 */
    
    struct {
      __IM  uint32_t data       : 32;           /*!< [31..0] mbist_done                                                        */
    } mbist_done_b;
  } ;
  
  union {
    __IM  uint32_t mbist_fail_nrml0;            /*!< (@ 0x00000050) MBIST Fail Normal Output Register0                         */
    
    struct {
      __IM  uint32_t data       : 32;           /*!< [31..0] mbist_fail_nrml0                                                  */
    } mbist_fail_nrml0_b;
  } ;
  
  union {
    __IM  uint32_t mbist_fail_nrml1;            /*!< (@ 0x00000054) MBIST Fail Normal Output Register1                         */
    
    struct {
      __IM  uint32_t data       : 32;           /*!< [31..0] mbist_fail_nrml1                                                  */
    } mbist_fail_nrml1_b;
  } ;
  
  union {
    __IM  uint32_t mbist_fail_nrml2;            /*!< (@ 0x00000058) MBIST Fail Normal Output Register2                         */
    
    struct {
      __IM  uint32_t dara       : 32;           /*!< [31..0] mbist_fail_nrml2                                                  */
    } mbist_fail_nrml2_b;
  } ;
  
  union {
    __IM  uint32_t mbist_fail_drf0;             /*!< (@ 0x0000005C) MBIST Fail DRF Output Register0                            */
    
    struct {
      __IM  uint32_t data       : 32;           /*!< [31..0] mbist_fail_drf0                                                   */
    } mbist_fail_drf0_b;
  } ;
  
  union {
    __IM  uint32_t mbist_fail_drf1;             /*!< (@ 0x00000060) MBIST Fail DRF Output Register1                            */
    
    struct {
      __IM  uint32_t data       : 32;           /*!< [31..0] mbist_fail_drf1                                                   */
    } mbist_fail_drf1_b;
  } ;
  
  union {
    __IM  uint32_t mbist_fail_drf2;             /*!< (@ 0x00000064) MBIST Fail DRF Output Register2                            */
    
