pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_vendor.h
    struct {
      __IM  uint32_t data       : 32;           /*!< [31..0] mbist_fail_drf2                                                   */
    } mbist_fail_drf2_b;
  } ;
  
  union {
    __IM  uint32_t mbist_start_pause0;          /*!< (@ 0x00000068) MBIST Start Pause Output Register0                         */
    
    struct {
      __IM  uint32_t data       : 32;           /*!< [31..0] mbist_start_pause0                                                */
    } mbist_start_pause0_b;
  } ;
  
  union {
    __IM  uint32_t mbist_start_pause1;          /*!< (@ 0x0000006C) MBIST Start Pause Output Register1                         */
    
    struct {
      __IM  uint32_t data       : 32;           /*!< [31..0] mbist_start_pause1                                                */
    } mbist_start_pause1_b;
  } ;
  
  union {
    __IM  uint32_t mbist_start_pause2;          /*!< (@ 0x00000070) MBIST Start Pause Output Register2                         */
    
    struct {
      __IM  uint32_t data       : 32;           /*!< [31..0] mbist_start_pause2                                                */
    } mbist_start_pause2_b;
  } ;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IM  uint32_t mbist_rom_misr_dout_l;       /*!< (@ 0x00000078) MBIST ROM MISR Data Output Low Register                    */
    
    struct {
      __IM  uint32_t data       : 32;           /*!< [31..0] rom_misr_dout[31:0] of memory misr                                */
    } mbist_rom_misr_dout_l_b;
  } ;
  
  union {
    __IM  uint32_t mbist_rom_misr_dout_h;       /*!< (@ 0x0000007C) MBIST ROM MISR Data Output High Register                   */
    
    struct {
      __IM  uint32_t data       : 32;           /*!< [31..0] rom_misr_dout[63:32] of memory misr                               */
    } mbist_rom_misr_dout_h_b;
  } ;
} VDR_Type;                                     /*!< Size = 128 (0x80)                                                         */



/* =========================================================================================================================== */
/* ================                                           VDR_S                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Vendor Registers (VDR_S)
  */

typedef struct {                                /*!< (@ 0x50002C00) VDR_S Structure                                            */
  
  union {
    __IOM uint32_t sec_low_pri_int_mode;        /*!< (@ 0x00000000) Secure Low Priority Interrupt Trigger Mode Control
                                                                    Register                                                   */
    
    struct {
      __IOM uint32_t sec_low_pri_int0_mode : 1; /*!< [0..0] Each bit control corresponding interrupt mode. 1: Rising
                                                     edge trigger 0: High level active                                         */
    } sec_low_pri_int_mode_b;
  } ;
  
  union {
    __IOM uint32_t sec_low_pri_int_imr;         /*!< (@ 0x00000004) Secure Low Priority Interrupt Mask Register                */
    
    struct {
      __IOM uint32_t rxi300_int_imr : 1;        /*!< [0..0] 1: Enable 0: Disable                                               */
    } sec_low_pri_int_imr_b;
  } ;
  
  union {
    __IOM uint32_t secure_low_pri_int_isr;      /*!< (@ 0x00000008) Secure Low Priority Interrupt Pending Status
                                                                    Register                                                   */
    
    struct {
      __IOM uint32_t rxi300_secure_bus_isr : 1; /*!< [0..0] RXI300 secure bus interrupt pending status. Wite 1 clear.          */
    } secure_low_pri_int_isr_b;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IM  uint32_t secure_gdma0_isr;            /*!< (@ 0x00000010) Secure GDMA Interrupt Pending Status Register              */
    
    struct {
      __IM  uint32_t gdma0_ch0_isr : 1;         /*!< [0..0] Secure GDMA channel 0 interrupt pending status                     */
      __IM  uint32_t gdma0_ch1_isr : 1;         /*!< [1..1] Secure GDMA channel 1 interrupt pending status                     */
    } secure_gdma0_isr_b;
  } ;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __OM  uint32_t super_sec_ef_ctrl;           /*!< (@ 0x00000020) Super Secure eFuse Control Register                        */
    
    struct {
      __OM  uint32_t sec_super_sec_ef_lock : 1; /*!< [0..0] When this bit is written to '1', this bit can not be
                                                     written to '0'. Beside the high speed platform is reset.
                                                     1: Super secure zone can not be accessed. 0: Super secure
                                                     zone just can be accessed by secure state. (AXI_PORT[1]
                                                     = 0)                                                                      */
    } super_sec_ef_ctrl_b;
  } ;
  __IM  uint32_t  RESERVED2[3];
  
  union {
    __OM  uint32_t non_fixed_secure_key0;       /*!< (@ 0x00000030) Non-Fixed Secure Key Register0                             */
    
    struct {
      __OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
    } non_fixed_secure_key0_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_secure_key1;       /*!< (@ 0x00000034) Non-Fixed Secure Key Register1                             */
    
    struct {
      __OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
    } non_fixed_secure_key1_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_secure_key2;       /*!< (@ 0x00000038) Non-Fixed Secure Key Register2                             */
    
