pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_vendor.h
    struct {
      __OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
    } non_fixed_secure_key2_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_secure_key3;       /*!< (@ 0x0000003C) Non-Fixed Secure Key Register3                             */
    
    struct {
      __OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
    } non_fixed_secure_key3_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_secure_key4;       /*!< (@ 0x00000040) Non-Fixed Secure Key Register4                             */
    
    struct {
      __OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
    } non_fixed_secure_key4_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_secure_key5;       /*!< (@ 0x00000044) Non-Fixed Secure Key Register5                             */
    
    struct {
      __OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
    } non_fixed_secure_key5_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_secure_key6;       /*!< (@ 0x00000048) Non-Fixed Secure Key Register6                             */
    
    struct {
      __OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
    } non_fixed_secure_key6_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_secure_key7;       /*!< (@ 0x0000004C) Non-Fixed Secure Key Register7                             */
    
    struct {
      __OM  uint32_t non_fixed_secure_key : 32; /*!< [31..0] Secure JTAG Key This register just can be written once.
                                                     After that, hardware need disable the writing function                    */
    } non_fixed_secure_key7_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_non_secure_key0;   /*!< (@ 0x00000050) Non-Fixed Non-Secure Key Register0                         */
    
    struct {
      __OM  uint32_t non_fixed_non_secure_key : 32;/*!< [31..0] Non-Secure JTAG Key This register just can be written
                                                     once. After that, hardware need disable the writing function              */
    } non_fixed_non_secure_key0_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_non_secure_key1;   /*!< (@ 0x00000054) Non-Fixed Non-Secure Key Register1                         */
    
    struct {
      __OM  uint32_t non_fixed_non_secure_key : 32;/*!< [31..0] Non-Secure JTAG Key This register just can be written
                                                     once. After that, hardware need disable the writing function              */
    } non_fixed_non_secure_key1_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_non_secure_key2;   /*!< (@ 0x00000058) Non-Fixed Non-Secure Key Register2                         */
    
    struct {
      __OM  uint32_t non_fixed_non_secure_key : 32;/*!< [31..0] Non-Secure JTAG Key This register just can be written
                                                     once. After that, hardware need disable the writing function              */
    } non_fixed_non_secure_key2_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_non_secure_key3;   /*!< (@ 0x0000005C) Non-Fixed Non-Secure Key Register3                         */
    
    struct {
      __OM  uint32_t non_fixed_non_secure_key : 32;/*!< [31..0] Non-Secure JTAG Key This register just can be written
                                                     once. After that, hardware need disable the writing function              */
    } non_fixed_non_secure_key3_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_non_secure_key4;   /*!< (@ 0x00000060) Non-Fixed Non-Secure Key Register4                         */
    
    struct {
      __OM  uint32_t non_fixed_non_secure_key : 32;/*!< [31..0] Non-Secure JTAG Key This register just can be written
                                                     once. After that, hardware need disable the writing function              */
    } non_fixed_non_secure_key4_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_non_secure_key5;   /*!< (@ 0x00000064) Non-Fixed Non-Secure Key Register5                         */
    
    struct {
      __OM  uint32_t non_fixed_non_secure_key : 32;/*!< [31..0] Non-Secure JTAG Key This register just can be written
                                                     once. After that, hardware need disable the writing function              */
    } non_fixed_non_secure_key5_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_non_secure_key6;   /*!< (@ 0x00000068) Non-Fixed Non-Secure Key Register6                         */
    
    struct {
      __OM  uint32_t non_fixed_non_secure_key : 32;/*!< [31..0] Non-Secure JTAG Key This register just can be written
                                                     once. After that, hardware need disable the writing function              */
    } non_fixed_non_secure_key6_b;
  } ;
  
  union {
    __OM  uint32_t non_fixed_non_secure_key7;   /*!< (@ 0x0000006C) Non-Fixed Non-Secure Key Register7                         */
    
    struct {
      __OM  uint32_t non_fixed_non_secure_key : 32;/*!< [31..0] Non-Secure JTAG Key This register just can be written
                                                     once. After that, hardware need disable the writing function              */
    } non_fixed_non_secure_key7_b;
  } ;
  
  union {
    __IOM uint32_t secure_jtag_swd_ctrl;        /*!< (@ 0x00000070) Secure JTAG SWD Control Register                           */
    
