pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_vendor.h
    struct {
      __IOM uint32_t fw_ready_sc : 1;           /*!< [0..0] In Non-Fixed Key Mode, Secure JTAG/SWD wait this signal.
                                                     0: Secue JTAG/SWD cannot execute the procedure of the unlocking
                                                     JTAG/SWD. 1: Secue JTAG/SWD can execute the procedure of
                                                     the unlocking JTAG/SWD. This register just can be written
                                                     once. After that, hardware need disable the writing function              */
      __IOM uint32_t fw_ready_nonsc : 1;        /*!< [1..1] In Non-Fixed Key Mode, Non-Secure JTAG/SWD wait this
                                                     signal. 0: Secue JTAG/SWD cannot execute the procedure
                                                     of the unlocking JTAG/SWD. 1: Secue JTAG/SWD can execute
                                                     the procedure of the unlocking JTAG/SWD. This register
                                                     just can be written once. After that, hardware need disable
                                                     the writing function                                                      */
    } secure_jtag_swd_ctrl_b;
  } ;
} VDR_S_Type;                                   /*!< Size = 116 (0x74)                                                         */


/** @} */ /* End of group vendor_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup vendor_peripheralAddr Vendor Function Registers Base Address
  * @ingroup hs_hal_vendor
  * @{
  */

#define VDR_BASE                    0x40002800UL
#define VDR_S_BASE                  0x50002C00UL

/** @} */ /* End of group vendor_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup vendor_type_declaration Vendor Functions Device Type
  * @ingroup hs_hal_vendor
  * @{
  */

#define VDR                         ((VDR_Type*)               VDR_BASE)
#define VDR_S                       ((VDR_S_Type*)             VDR_S_BASE)

/** @} */ /* End of group vendor_type_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif

#include "rtl8710c_vdr_type.h"
#include "rtl8710c_vdr_s_type.h"
    
/// @endcond /* End of condition DOXYGEN_VDR_REG_TYPE */
    

#ifdef __cplusplus
}
#endif

#endif /* RTL8710C_VENDOR_H */



/** @} */ /* End of group rtl8710c_vendor */

/** @} */ /* End of group Realtek Semiconductor Corp. */
